cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx_private.h
/***********************************************************************************************************************
* Copyright (c) 2013 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_riic_private.h
 * Description  : Functions for using RIIC on RX devices. 
 **********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.07.2013 1.00     First Release
 *         : 30.09.2013 1.10     Change symbol of return value and status
 *         : 08.10.2013 1.20     Modified processing for the I/O register initialization and mode transition 
 *                                when a stop condition is detected while the slave is communicating.
 *                               Modified processing for mode transition when an API function is called
 *                                while the bus is busy.
 *                               Modified processing for mode transition
 *                                when an arbitration lost occurred and the addresses do not match.
 *                               Modified incorrect slave transmission after the master reception.
 *                               Modified processing for the I/O register initialization
 *                                when generating a start condition and receiving the slave address.
 *         : 17.07.2014 1.30     Added the parameters for the timeout detection.
 *                               The number of channels varies depending on the MCU.
 *                               Therefore, parameter setting for each channel is set 
 *                               in the private header file(r_riic_rx###_private.h) for each MCU folder
 *                               instead of this file.
 *                               (### is 111 or 110 or 113 or 64m)
 *         : 22.09.2014 1.40     The module is updated to measure the issue that slave communication 
 *                               is not available after an arbitration-lost occurs and the bus is locked. 
 *                                 The issue occurs when the following four conditions are all met.
 *                                    - RIIC FIT module rev. 1.30 or earlier is used.
 *                                    - RX device operates as both the master and the slave 
 *                                      in multi-master communication.
 *                                    - An arbitration-lost is detected when communicating as the master.
 *                                    - Communication other than master reception or slave reception is performed.
 *         : 14.11.2014 1.50     Added RX113 support.
 *         : 09.10.2014 1.60     Added RX71M support.
 *         : 20.10.2014 1.70     Added RX231 support.
 *         : 31.10.2015 1.80     Added RX130, RX230, RX23T support.
 *         : 04.03.2016 1.90     Added RX24T support.Changed about the pin definisions.
 *         : 01.10.2016 2.00     Added RX65N support.
 *         : 02.06.2017 2.10     Deleted RIIC port definitions of RIIC3.
 *                               Changed include path becuase changed file structure.
 *                               Added include of the RX24U header file.
 *                               Added macro definition RIIC_PRV_PCR_BASE_REG, RIIC_PRV_PDR_BASE_REG,
 *                                RIIC_PRV_PMR_BASE_REG and RIIC_PRV_PFS_BASE_REG.
 *                               Deleted interrupt functions of RIIC3.
 *                               Deleted macro definition RIIC_TMOE.
 *         : 31.08.2017 2.20     Fixed the macro definition conversion processing of pin.
 *         : 30.10.2017 2.30     Added RX66T support. 
 *         : 15.10.2018 2.40     Added RX72T support.
 *         : 20.06.2019 2.42     Added RX23W support.
 *         : 30.07.2019 2.43     Added RX72M support.
 *         : 10.10.2019 2.44     Added RX13T support.
 *         : 22.11.2019 2.45     Added RX66N, RX72N support.
 *         : 10.03.2020 2.46     Added RX23E-A support.
 *         : 30.06.2021 2.48     Added RX671 support.
 *         : 31.07.2021 2.49     Added RX140 support.
 *         : 31.12.2021 2.50     Added RX660 support.
 *         : 31.03.2023 2.70     Added RX26T support.
 *         : 29.05.2023 2.80     Added RX23E-B support.
 *                               Fixed to comply with GSCE Coding Standards Rev.6.5.0
 *         : 08.08.2024 3.00     Added RX260, RX261 support.
 *         : 15.03.2025 3.01     Updated disclaimer.
 *         : 30.10.2025 3.10     Added RX14T support.
 **********************************************************************************************************************/
/* Guards against multiple inclusion */
#ifndef RIIC_PRIVATE_H
    #define RIIC_PRIVATE_H
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Fixed width integer support. */
    #include "r_riic_rx_if.h"
    #include "r_riic_rx_pin_config.h"
    #include "r_riic_rx_config.h"

/* Include specifics for chosen MCU.  */
    #if defined(BSP_MCU_RX111)
        #include "./targets/rx111/r_riic_rx111_private.h"
    #elif defined(BSP_MCU_RX110)
        #include "./targets/rx110/r_riic_rx110_private.h"
    #elif defined(BSP_MCU_RX113)
        #include "./targets/rx113/r_riic_rx113_private.h"
    #elif defined(BSP_MCU_RX64M)
        #include "./targets/rx64m/r_riic_rx64m_private.h"
    #elif defined(BSP_MCU_RX65N)
        #include "./targets/rx65n/r_riic_rx65n_private.h"
    #elif defined(BSP_MCU_RX660)
        #include "./targets/rx660/r_riic_rx660_private.h"
    #elif defined(BSP_MCU_RX66T)
        #include "./targets/rx66t/r_riic_rx66t_private.h"
    #elif defined(BSP_MCU_RX671)
        #include "./targets/rx671/r_riic_rx671_private.h"
    #elif defined(BSP_MCU_RX71M)
        #include "./targets/rx71m/r_riic_rx71m_private.h"
    #elif defined(BSP_MCU_RX231)
        #include "./targets/rx231/r_riic_rx231_private.h"
    #elif defined(BSP_MCU_RX130)
        #include "./targets/rx130/r_riic_rx130_private.h"
    #elif defined(BSP_MCU_RX140)
        #include "./targets/rx140/r_riic_rx140_private.h"
    #elif defined(BSP_MCU_RX14T)
        #include "./targets/rx14t/r_riic_rx14t_private.h"
    #elif defined(BSP_MCU_RX230)
        #include "./targets/rx230/r_riic_rx230_private.h"
    #elif defined(BSP_MCU_RX23T)
        #include "./targets/rx23t/r_riic_rx23t_private.h"
    #elif defined(BSP_MCU_RX24T)
        #include "./targets/rx24t/r_riic_rx24t_private.h"
    #elif defined(BSP_MCU_RX24U)
        #include "./targets/rx24u/r_riic_rx24u_private.h"
    #elif defined(BSP_MCU_RX72T)
        #include "./targets/rx72t/r_riic_rx72t_private.h"
    #elif defined(BSP_MCU_RX23W)
        #include "./targets/rx23w/r_riic_rx23w_private.h"
    #elif defined(BSP_MCU_RX72M)
        #include "./targets/rx72m/r_riic_rx72m_private.h"
    #elif defined(BSP_MCU_RX13T)
        #include "./targets/rx13t/r_riic_rx13t_private.h"
    #elif defined(BSP_MCU_RX66N)
        #include "./targets/rx66n/r_riic_rx66n_private.h"
    #elif defined(BSP_MCU_RX72N)
        #include "./targets/rx72n/r_riic_rx72n_private.h"
    #elif defined(BSP_MCU_RX23E_A)
        #include "./targets/rx23e-a/r_riic_rx23e_a_private.h"
    #elif defined(BSP_MCU_RX26T)
        #include "./targets/rx26t/r_riic_rx26t_private.h"
    #elif defined(BSP_MCU_RX23E_B)
        #include "./targets/rx23e-b/r_riic_rx23e_b_private.h"
    #elif defined(BSP_MCU_RX260)
        #include "./targets/rx260/r_riic_rx260_private.h"
    #elif defined(BSP_MCU_RX261)
        #include "./targets/rx261/r_riic_rx261_private.h"
    #else
        #error "This MCU is not supported by the current r_riic_rx module."
    #endif

