cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx_private.h
/***********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   Define for calculation processing.                                       */
/*----------------------------------------------------------------------------*/
/* Bit position masks */
    #define BIT0                      ((uint8_t)(0x01))
    #define BIT1                      ((uint8_t)(0x02))
    #define BIT2                      ((uint8_t)(0x04))
    #define BIT3                      ((uint8_t)(0x08))
    #define BIT4                      ((uint8_t)(0x10))
    #define BIT5                      ((uint8_t)(0x20))
    #define BIT6                      ((uint8_t)(0x40))
    #define BIT7                      ((uint8_t)(0x80))

    #define RIIC_MAX_DIV              ((uint8_t)(0x08))
    #define RIIC_STAD_SPPED_MAX       ((uint8_t)(100))
    #define RIIC_FAST_SPPED_MAX       ((uint16_t)(400))
    #define RIIC_ICBR_MAX             ((uint8_t)(32))

/*----------------------------------------------------------------------------*/
/*   Define send data of blank.                                               */
/*----------------------------------------------------------------------------*/
    #define BLANK                     ((uint8_t)(0xFF))

/*----------------------------------------------------------------------------*/
/*   Define R/W code for slave address.                                       */
/*----------------------------------------------------------------------------*/
    #define W_CODE                    ((uint8_t)(0xFE))       /* Write code for slave address */
    #define R_CODE                    ((uint8_t)(0x01))       /* Read code for slave address */

/*----------------------------------------------------------------------------*/
/*   Define of port control.                                                  */
/*----------------------------------------------------------------------------*/
    #define RIIC_OUT                  ((uint8_t)(0x01))       /* Port Output */
    #define RIIC_IN                   ((uint8_t)(0x00))       /* Port Input */

/*----------------------------------------------------------------------------*/
/*   Define bool type.                                                        */
/*----------------------------------------------------------------------------*/
    #define RIIC_FALSE                ((bool)(0))             /* False */
    #define RIIC_TRUE                 ((bool)(1))             /* True */

/*----------------------------------------------------------------------------*/
/* Define software SCL Low check counter                                      */
/*----------------------------------------------------------------------------*/
    #define RIIC_CFG_SCL_CHECK_COUNTER      (1000U)

/* RIIC port (ascii to number) */
/* RIIC0 */
    #if ((('0') <= R_RIIC_CFG_RIIC0_SCL0_PORT) && (('9') >= R_RIIC_CFG_RIIC0_SCL0_PORT))
        #define RIIC_CH0_SCL0_GP (R_RIIC_CFG_RIIC0_SCL0_PORT - 0x30)
    #elif ((('A') <= R_RIIC_CFG_RIIC0_SCL0_PORT) && (('H') >= R_RIIC_CFG_RIIC0_SCL0_PORT))
        #define RIIC_CH0_SCL0_GP (R_RIIC_CFG_RIIC0_SCL0_PORT - 0x37)
    #elif ((('J') <= R_RIIC_CFG_RIIC0_SCL0_PORT) && (('K') >= R_RIIC_CFG_RIIC0_SCL0_PORT))
/* PORTI does not exist in the PORT group. PORTJ register is placed at the position of PORTI register. */
        #define RIIC_CH0_SCL0_GP (R_RIIC_CFG_RIIC0_SCL0_PORT - 0x38)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC0_SCL0_PORT in r_riic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_RIIC_CFG_RIIC0_SCL0_BIT) && (('7') >= R_RIIC_CFG_RIIC0_SCL0_BIT))
        #define RIIC_CH0_SCL0_PIN    (R_RIIC_CFG_RIIC0_SCL0_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC0_SCL0_BIT in r_riic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_RIIC_CFG_RIIC0_SDA0_PORT) && (('9') >= R_RIIC_CFG_RIIC0_SDA0_PORT))
        #define RIIC_CH0_SDA0_GP (R_RIIC_CFG_RIIC0_SDA0_PORT - 0x30)
    #elif ((('A') <= R_RIIC_CFG_RIIC0_SDA0_PORT) && (('H') >= R_RIIC_CFG_RIIC0_SDA0_PORT))
        #define RIIC_CH0_SDA0_GP (R_RIIC_CFG_RIIC0_SDA0_PORT - 0x37)
    #elif ((('J') <= R_RIIC_CFG_RIIC0_SDA0_PORT) && (('K') >= R_RIIC_CFG_RIIC0_SDA0_PORT))
/* PORTI does not exist in the PORT group. PORTJ register is placed at the position of PORTI register. */
        #define RIIC_CH0_SDA0_GP (R_RIIC_CFG_RIIC0_SDA0_PORT - 0x38)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC0_SDA0_PORT in r_riic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_RIIC_CFG_RIIC0_SDA0_BIT) && (('7') >= R_RIIC_CFG_RIIC0_SDA0_BIT))
        #define RIIC_CH0_SDA0_PIN    (R_RIIC_CFG_RIIC0_SDA0_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC0_SDA0_BIT in r_riic_rx_pin_config.h"
    #endif

/* RIIC1 */
    #if ((('0') <= R_RIIC_CFG_RIIC1_SCL1_PORT) && (('9') >= R_RIIC_CFG_RIIC1_SCL1_PORT))
        #define RIIC_CH1_SCL1_GP (R_RIIC_CFG_RIIC1_SCL1_PORT - 0x30)
    #elif ((('A') <= R_RIIC_CFG_RIIC1_SCL1_PORT) && (('H') >= R_RIIC_CFG_RIIC1_SCL1_PORT))
        #define RIIC_CH1_SCL1_GP (R_RIIC_CFG_RIIC1_SCL1_PORT - 0x37)
    #elif ((('J') <= R_RIIC_CFG_RIIC1_SCL1_PORT) && (('K') >= R_RIIC_CFG_RIIC1_SCL1_PORT))
/* PORTI does not exist in the PORT group. PORTJ register is placed at the position of PORTI register. */
        #define RIIC_CH1_SCL1_GP (R_RIIC_CFG_RIIC1_SCL1_PORT - 0x38)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC1_SCL1_PORT in r_riic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_RIIC_CFG_RIIC1_SCL1_BIT) && (('7') >= R_RIIC_CFG_RIIC1_SCL1_BIT))
        #define RIIC_CH1_SCL1_PIN    (R_RIIC_CFG_RIIC1_SCL1_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC1_SCL1_BIT in r_riic_rx_pin_config.h"
    #endif

