cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx_private.h
    #if ((('0') <= R_RIIC_CFG_RIIC1_SDA1_PORT) && (('9') >= R_RIIC_CFG_RIIC1_SDA1_PORT))
        #define RIIC_CH1_SDA1_GP (R_RIIC_CFG_RIIC1_SDA1_PORT - 0x30)
    #elif ((('A') <= R_RIIC_CFG_RIIC1_SDA1_PORT) && (('H') >= R_RIIC_CFG_RIIC1_SDA1_PORT))
        #define RIIC_CH1_SDA1_GP (R_RIIC_CFG_RIIC1_SDA1_PORT - 0x37)
    #elif ((('J') <= R_RIIC_CFG_RIIC1_SDA1_PORT) && (('K') >= R_RIIC_CFG_RIIC1_SDA1_PORT))
/* PORTI does not exist in the PORT group. PORTJ register is placed at the position of PORTI register. */
        #define RIIC_CH1_SDA1_GP (R_RIIC_CFG_RIIC1_SDA1_PORT - 0x38)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC1_SDA1_PORT in r_riic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_RIIC_CFG_RIIC1_SDA1_BIT) && (('7') >= R_RIIC_CFG_RIIC1_SDA1_BIT))
        #define RIIC_CH1_SDA1_PIN    (R_RIIC_CFG_RIIC1_SDA1_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC1_SDA1_BIT in r_riic_rx_pin_config.h"
    #endif

/* RIIC2 */
    #if ((('0') <= R_RIIC_CFG_RIIC2_SCL2_PORT) && (('9') >= R_RIIC_CFG_RIIC2_SCL2_PORT))
        #define RIIC_CH2_SCL2_GP (R_RIIC_CFG_RIIC2_SCL2_PORT - 0x30)
    #elif ((('A') <= R_RIIC_CFG_RIIC2_SCL2_PORT) && (('H') >= R_RIIC_CFG_RIIC2_SCL2_PORT))
        #define RIIC_CH2_SCL2_GP (R_RIIC_CFG_RIIC2_SCL2_PORT - 0x37)
    #elif ((('J') <= R_RIIC_CFG_RIIC2_SCL2_PORT) && (('K') >= R_RIIC_CFG_RIIC2_SCL2_PORT))
/* PORTI does not exist in the PORT group. PORTJ register is placed at the position of PORTI register. */
        #define RIIC_CH2_SCL2_GP (R_RIIC_CFG_RIIC2_SCL2_PORT - 0x38)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC2_SCL2_PORT in r_riic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_RIIC_CFG_RIIC2_SCL2_BIT) && (('7') >= R_RIIC_CFG_RIIC2_SCL2_BIT))
        #define RIIC_CH2_SCL2_PIN    (R_RIIC_CFG_RIIC2_SCL2_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC2_SCL2_BIT in r_riic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_RIIC_CFG_RIIC2_SDA2_PORT) && (('9') >= R_RIIC_CFG_RIIC2_SDA2_PORT))
        #define RIIC_CH2_SDA2_GP (R_RIIC_CFG_RIIC2_SDA2_PORT - 0x30)
    #elif ((('A') <= R_RIIC_CFG_RIIC2_SDA2_PORT) && (('H') >= R_RIIC_CFG_RIIC2_SDA2_PORT))
        #define RIIC_CH2_SDA2_GP (R_RIIC_CFG_RIIC2_SDA2_PORT - 0x37)
    #elif ((('J') <= R_RIIC_CFG_RIIC2_SDA2_PORT) && (('K') >= R_RIIC_CFG_RIIC2_SDA2_PORT))
/* PORTI does not exist in the PORT group. PORTJ register is placed at the position of PORTI register. */
        #define RIIC_CH2_SDA2_GP (R_RIIC_CFG_RIIC2_SDA2_PORT - 0x38)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC2_SDA2_PORT in r_riic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_RIIC_CFG_RIIC2_SDA2_BIT) && (('7') >= R_RIIC_CFG_RIIC2_SDA2_BIT))
        #define RIIC_CH2_SDA2_PIN    (R_RIIC_CFG_RIIC2_SDA2_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_RIIC_CFG_RIIC2_SDA2_BIT in r_riic_rx_pin_config.h"
    #endif

/*============================================================================*/
/*  Configuration Options of non support                                      */
/*============================================================================*/
/* Setting to */
/* 0 = disable, 1 = enable */
    #define RIIC_CFG_NACK_AL_ENABLE         (0)
    #define RIIC_CFG_SLAVE_AL_ENABLE        (0)
    #define RIIC_CFG_NACK_SUSPEND_ENABLE    (1)
    #define RIIC_CFG_SCL_SYNC_ENABLE        (1)

/*============================================================================*/
/*  Parameter check of Configuration Options                                  */
/*============================================================================*/
    #if ((0 != RIIC_CFG_PARAM_CHECKING_ENABLE) && (1 != RIIC_CFG_PARAM_CHECKING_ENABLE))
        #error "ERROR - RIIC_CFG_PARAM_CHECKING_ENABLE - Parameter error in configures file.  "
    #endif

    #if ((0 != RIIC_CFG_PORT_SET_PROCESSING) && (1 != RIIC_CFG_PORT_SET_PROCESSING))
        #error "ERROR - RIIC_CFG_PORT_SET_PROCESSING - Parameter error in configures file.  "
    #endif

    #if ((0 != RIIC_CFG_NACK_AL_ENABLE) && (1 != RIIC_CFG_NACK_AL_ENABLE))
        #error "ERROR - RIIC_CFG_NACK_AL_ENABLE - Parameter error in configures file.  "
    #endif

    #if ((0 != RIIC_CFG_SLAVE_AL_ENABLE) && (1 != RIIC_CFG_SLAVE_AL_ENABLE))
        #error "ERROR - RIIC_CFG_SLAVE_AL_ENABLE - Parameter error in configures file.  "
    #endif

    #if ((0 != RIIC_CFG_NACK_SUSPEND_ENABLE) && (1 != RIIC_CFG_NACK_SUSPEND_ENABLE))
        #error "ERROR - RIIC_CFG_NACK_SUSPEND_ENABLE - Parameter error in configures file.  "
    #endif

    #if ((0 != RIIC_CFG_SCL_SYNC_ENABLE) && (1 != RIIC_CFG_SCL_SYNC_ENABLE))
        #error "ERROR - RIIC_CFG_SCL_SYNC_ENABLE - Parameter error in configures file.  "
    #endif

    #if ((0x00000000 > RIIC_CFG_BUS_CHECK_COUNTER) || (0xFFFFFFFF < RIIC_CFG_BUS_CHECK_COUNTER))
        #error "ERROR - RIIC_CFG_BUS_CHECK_COUNTER - Parameter error in configures file.  "
    #endif

/*============================================================================*/
/*   Define for register setting.                                             */
/*============================================================================*/
/* Interrupt register setting */
    #define RIIC_IR_CLR             ((uint8_t)(0x00))       /* Clears interrupt request register. */
    #define RIIC_IR_SET             ((uint8_t)(0x01))       /* Sets interrupt request register. */
    #define RIIC_IER_DISABLE        (0U)                    /* Disables interrupt request enable register. */
    #define RIIC_IER_ENABLE         (1U)                    /* Enables interrupt request enable register. */

/* RIIC register setting */
    #define RIIC_ICCR1_NOT_DRIVEN   ((uint8_t)(0x00))       /* Clears ICCR1.ICE bit. */
    #define RIIC_ICCR1_ICE          ((uint8_t)(0x80))       /* ICCR1.ICE bit. */
    #define RIIC_ICCR1_ICE_SET      ((uint8_t)(0x80))       /* Sets ICCR1.ICE bit. */
    #define RIIC_ICCR1_ICE_CLR      ((uint8_t)(0x7F))       /* Clears ICCR1.ICE bit. */
    #define RIIC_ICCR1_RIIC_RESET   ((uint8_t)(0x40))       /* Sets ICCR1.IICRST bit. */
    #define RIIC_ICCR1_ENABLE       ((uint8_t)(0xBF))       /* Clears ICCR1.IICRST bit. */
    #define RIIC_ICCR1_CLO_SET      ((uint8_t)(0x20))       /* Sets ICCR1.CLO bit. */
    #define RIIC_ICCR1_SOWP         ((uint8_t)(0x10))       /* ICCR1.SOWP bit. */
    #define RIIC_ICCR1_SOWP_SET     ((uint8_t)(0x10))       /* Sets ICCR1.SOWP bit. */
    #define RIIC_ICCR1_SOWP_CLR     ((uint8_t)(0xEF))       /* Clears ICCR1.SOWP bit. */
    #define RIIC_ICCR1_SDAO_SCLO_SET ((uint8_t)(0x1F))      /* Clears ICCR1.SOWP bit. Sets ICCR1.SDAO and SCL0 bit*/
    #define RIIC_ICCR1_SDAI         ((uint8_t)(0x01))       /* Mask for ICCR1.SDAI bit. */
    #define RIIC_ICCR1_SDAI_SET     ((uint8_t)(0x01))       /* Sets for ICCR1.SDAI bit. */
    #define RIIC_ICCR1_SCLI         ((uint8_t)(0x02))       /* Mask for ICCR1.SCLI bit. */
    #define RIIC_ICCR1_SCLI_SET     ((uint8_t)(0x02))       /* Sets for ICCR1.SCLI bit. */
    #define RIIC_ICCR1_SDAO         ((uint8_t)(0x04))       /* Mask for ICCR1.SDAO bit. */
    #define RIIC_ICCR1_SDAO_SET     ((uint8_t)(0x04))       /* Sets for ICCR1.SDAO bit. */
    #define RIIC_ICCR1_SCLO         ((uint8_t)(0x08))       /* Mask for ICCR1.SCLO bit. */
    #define RIIC_ICCR1_SCLO_SET     ((uint8_t)(0x08))       /* Sets for ICCR1.SCLO bit. */
    #define RIIC_SARL0_INIT         ((uint8_t)(0x00))       /* Sets SARLy and SARUy.(y=0,1,2) */
    #define RIIC_SARU0_INIT         ((uint8_t)(0x00))       /* Sets SARLy and SARUy.(y=0,1,2) */
    #define RIIC_SARL1_INIT         ((uint8_t)(0x00))       /* Sets SARLy and SARUy.(y=0,1,2) */
    #define RIIC_SARU1_INIT         ((uint8_t)(0x00))       /* Sets SARLy and SARUy.(y=0,1,2) */
    #define RIIC_SARL2_INIT         ((uint8_t)(0x00))       /* Sets SARLy and SARUy.(y=0,1,2) */
    #define RIIC_SARU2_INIT         ((uint8_t)(0x00))       /* Sets SARLy and SARUy.(y=0,1,2) */
    #define RIIC_SARL_MASK          ((uint16_t)(0x00FF))    /* Mask for SARLy setting. */
    #define RIIC_SARU_MASK          ((uint16_t)(0x0300))    /* Mask for SARUy setting. */
    #define RIIC_SARU_10BIT_FORMAT_SET ((uint8_t)(0x01))    /* Sets SARUy.FS bit. */
    #define RIIC_ICSER_INIT         ((uint8_t)(0x00))       /* Sets ICSER */
    #define RIIC_ICSER_SAR_DASABLE  ((uint8_t)(0xF8))       /* Clears ICSER.SAR0E,SAR1E,SAR2E bit */
    #define RIIC_ICSER_SAR0E_SET    ((uint8_t)(0x01))       /* Sets ICSER.SAR0E bit */
    #define RIIC_ICSER_SAR0E_CLR    ((uint8_t)(0xFE))       /* Clears ICSER.SAR0E bit */
    #define RIIC_ICSER_SAR1E_SET    ((uint8_t)(0x02))       /* Sets ICSER.SAR1E bit */
    #define RIIC_ICSER_SAR1E_CLR    ((uint8_t)(0xFD))       /* Clears ICSER.SAR1E bit */
    #define RIIC_ICSER_SAR2E_SET    ((uint8_t)(0x04))       /* Sets ICSER.SAR2E bit */
    #define RIIC_ICSER_SAR2E_CLR    ((uint8_t)(0xFB))       /* Clears ICSER.SAR2E bit */
    #define RIIC_ICSER_GCAE_SET     ((uint8_t)(0x08))       /* Sets ICSER.GCAE bit */
    #define RIIC_ICSER_GCAE_CLR     ((uint8_t)(0xF7))       /* Clears ICSER.GCAE bit */
    #define RIIC_ICSER_DIDE_SET     ((uint8_t)(0x20))       /* Sets ICSER.DIDE bit */
    #define RIIC_ICSER_DIDE_CLR     ((uint8_t)(0xDF))       /* Clears ICSER.DIDE bit */

    #define RIIC_ICMR1_MTWP_SET     ((uint8_t)(0x80))       /* Sets ICMR1.MTWP bit. */
    #define RIIC_ICMR1_MTWP_CLR     ((uint8_t)(0x7F))       /* Clears ICMR1.MTWP bit. */
    #define RIIC_ICMR2_INIT         ((uint8_t)(0x00))       /* Sets ICMR2 */

    #if RIIC_CFG_NACK_AL_ENABLE == 0
        #define RIIC_NALE               ((uint8_t)(0x00))       /* Mask for ICFER.NALE bit. */
    #elif RIIC_CFG_NACK_AL_ENABLE == 1
        #define RIIC_NALE               ((uint8_t)(0x04))       /* Mask for ICFER.NALE bit. */
    #endif

    #if RIIC_CFG_SLAVE_AL_ENABLE == 0
        #define RIIC_SALE               ((uint8_t)(0x00))       /* Mask for ICFER.SALE bit. */
    #elif RIIC_CFG_SLAVE_AL_ENABLE == 1
        #define RIIC_SALE               ((uint8_t)(0x08))       /* Mask for ICFER.SALE bit. */
    #endif

    #if RIIC_CFG_NACK_SUSPEND_ENABLE == 0
        #define RIIC_NACKE              ((uint8_t)(0x00))       /* Mask for ICFER.NACKE bit. */
    #elif RIIC_CFG_NACK_SUSPEND_ENABLE == 1
        #define RIIC_NACKE              ((uint8_t)(0x10))       /* Mask for ICFER.NACKE bit. */
    #endif

