cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx_private.h
    #if RIIC_CFG_SCL_SYNC_ENABLE == 0
        #define RIIC_SCLE               ((uint8_t)(0x00))       /* Mask for ICFER.SCLE bit. */
    #elif RIIC_CFG_SCL_SYNC_ENABLE == 1
        #define RIIC_SCLE               ((uint8_t)(0x40))       /* Mask for ICFER.SCLE bit. */
    #endif

    #define RIIC_ICCR2_ST           ((uint8_t)(0x02))       /* Mask for ICCR2.ST bit. */
    #define RIIC_ICCR2_RS           ((uint8_t)(0x04))       /* Mask for ICCR2.RS bit. */
    #define RIIC_ICCR2_SP           ((uint8_t)(0x08))       /* Mask for ICCR2.SP bit. */
    #define RIIC_ICCR2_TRS          ((uint8_t)(0x20))       /* Mask for ICCR2.TRS bit. */
    #define RIIC_ICCR2_TRS_SET      ((uint8_t)(0x20))       /* Sets ICCR2.TRS bit. */
    #define RIIC_ICCR2_TRS_CLR      ((uint8_t)(0xDF))       /* Clears ICCR2.TRS bit. */
    #define RIIC_ICCR2_MST          ((uint8_t)(0x40))       /* Mask for ICCR2.MST bit. */
    #define RIIC_ICCR2_MST_SET      ((uint8_t)(0x40))       /* Sets ICCR2.MST bit. */
    #define RIIC_ICCR2_BBSY         ((uint8_t)(0x80))       /* Mask for ICCR2.BBSY bit. */
    #define RIIC_ICCR2_BBSY_SET     ((uint8_t)(0x80))       /* Sets ICCR2.BBSY bit. */
    #define RIIC_ICMR2_TMWE         ((uint8_t)(0x08))       /* Mask for ICMR2.TMWE bit. */
    #define RIIC_ICMR2_TMWE_SET     ((uint8_t)(0x08))       /* Sets ICMR2.TMWE bit. */
    #define RIIC_ICMR2_TMWE_CLR     ((uint8_t)(0xF7))       /* Clear ICMR2.TMWE bit. */
    #define RIIC_ICMR3_WAIT_SET     ((uint8_t)(0x40))       /* Sets ICMR3.WAIT bit. */
    #define RIIC_ICMR3_WAIT_CLR     ((uint8_t)(0xBF))       /* Clears ICMR3.WAIT bit. */
    #define RIIC_ICMR3_RDRFS_SET    ((uint8_t)(0x20))       /* Sets ICMR3.RDRFS bit. */
    #define RIIC_ICMR3_RDRFS_CLR    ((uint8_t)(0xDF))       /* Clears ICMR3.RDRFS bit. */
    #define RIIC_ICMR3_ACKWP_SET    ((uint8_t)(0x10))       /* Sets ICMR3.ACKWP bit. */
    #define RIIC_ICMR3_ACKWP_CLR    ((uint8_t)(0xEF))       /* Clears ICMR3.ACKWP bit. */
    #define RIIC_ICMR3_ACKBT_SET    ((uint8_t)(0x08))       /* Sets ICMR3.ACKBT bit. */
    #define RIIC_ICMR3_ACKBT_CLR    ((uint8_t)(0xF7))       /* Clears ICMR3.ACKBT bit. */
    #define RIIC_ICSR1_AAS0         ((uint8_t)(0x01))       /* Mask for ICSR1.AAS0 bit. */
    #define RIIC_ICSR1_AAS0_SET     ((uint8_t)(0x01))       /* Sets ICSR1.AAS0 bit. */
    #define RIIC_ICSR1_AAS1         ((uint8_t)(0x02))       /* Mask for ICSR1.AAS1 bit. */
    #define RIIC_ICSR1_AAS1_SET     ((uint8_t)(0x02))       /* Sets ICSR1.AAS1 bit. */
    #define RIIC_ICSR1_AAS2         ((uint8_t)(0x04))       /* Mask for ICSR1.AAS2 bit. */
    #define RIIC_ICSR1_AAS2_SET     ((uint8_t)(0x04))       /* Sets ICSR1.AAS2 bit. */
    #define RIIC_ICSR1_GCA          ((uint8_t)(0x08))       /* Mask for ICSR1.GCA bit. */
    #define RIIC_ICSR1_GCA_SET      ((uint8_t)(0x08))       /* Sets ICSR1.GCA bit. */
    #define RIIC_ICSR1_DID          ((uint8_t)(0x20))       /* Mask for ICSR1.DID bit. */
    #define RIIC_ICSR1_DID_SET      ((uint8_t)(0x20))       /* Sets ICSR1.DID bit. */
    #define RIIC_ICSR1_HOA          ((uint8_t)(0x80))       /* Mask for ICSR1.HOA bit. */
    #define RIIC_ICSR1_HOA_SET      ((uint8_t)(0x80))       /* Sets ICSR1.HOA bit. */
    #define RIIC_ICSR2_TMOF         ((uint8_t)(0x01))       /* Mask for ICSR2.TMOF bit. */
    #define RIIC_ICSR2_TMOF_SET     ((uint8_t)(0x01))       /* Sets ICSR2.TMOF bit. */
    #define RIIC_ICSR2_AL           ((uint8_t)(0x02))       /* Mask for ICSR2.AL bit. */
    #define RIIC_ICSR2_AL_SET       ((uint8_t)(0x02))       /* Sets ICSR2.AL bit. */
    #define RIIC_ICSR2_AL_CLR       ((uint8_t)(0xFD))       /* Clears ICSR2.AL bit. */
    #define RIIC_ICSR2_START        ((uint8_t)(0x04))       /* Mask for ICSR2.START bit. */
    #define RIIC_ICSR2_START_SET    ((uint8_t)(0x04))       /* Sets ICSR2.START bit. */
    #define RIIC_ICSR2_START_CLR    ((uint8_t)(0xFB))       /* Clears ICSR2.START bit. */
    #define RIIC_ICSR2_STOP         ((uint8_t)(0x08))       /* Mask for ICSR2.STOP bit. */
    #define RIIC_ICSR2_STOP_SET     ((uint8_t)(0x08))       /* Sets ICSR2.STOP bit. */
    #define RIIC_ICSR2_STOP_CLR     ((uint8_t)(0xF7))       /* Clears ICSR2.STOP bit. */
    #define RIIC_ICSR2_NACKF        ((uint8_t)(0x10))       /* Mask for ICSR2.NACKF bit. */
    #define RIIC_ICSR2_NACKF_SET    ((uint8_t)(0x10))       /* Sets ICSR2.NACKF bit. */
    #define RIIC_ICSR2_NACKF_CLR    ((uint8_t)(0xEF))       /* Clears ICSR2.NACKF bit. */
    #define RIIC_ICSR2_RDRF         ((uint8_t)(0x20))       /* Mask for ICSR2.RDRF bit. */
    #define RIIC_ICSR2_RDRF_SET     ((uint8_t)(0x20))       /* Sets ICSR2.RDRF bit. */
    #define RIIC_ICSR2_TDRE         ((uint8_t)(0x80))       /* Mask for ICSR2.TDRE bit. */
    #define RIIC_ICSR2_TDRE_SET     ((uint8_t)(0x80))       /* Sets ICSR2.TDRE bit. */
    #define RIIC_ICSR2_DISABLE      ((uint8_t)(0xE7))       /* Clears ICSR2.NACKF bit and STOP bit. */

    #define RIIC_ICIER_INIT         ((uint8_t)(0x00))       /* Initializes ICIER. */
    #define RIIC_ICIER_ST_NAK_AL    ((uint8_t)(0x16))       /* Sets ICIER.STIE bit. */
/* Enable bit  : ALIE, STIE, NAKIE          */
/* Disable bit : TMOIE, SPIE, RIE, TEIE, TIE */
    #define RIIC_ICIER_SP_NAK_AL    ((uint8_t)(0x1A))       /* Sets ICIER.SPIE bit and NAKIE. */
/* Enable bit  : ALIE, SPIE, NAKIE          */
/* Disable bit : TMOIE, STIE, RIE, TEIE, TIE */
    #define RIIC_ICIER_TEND_NAK_AL  ((uint8_t)(0x52))       /* Sets ICIER.TEIE bit. */
/* Enable bit  : ALIE, NAKIE, TEIE          */
/* Disable bit : TMOIE, STIE, SPIE, RIE, TIE */
    #define RIIC_ICIER_RX_NAK_AL    ((uint8_t)(0x32))       /* Sets ICIER.RIE bit. */
/* Enable bit  : ALIE, NAKIE, RIE           */
/* Disable bit : TMOIE, STIE, SPIE, TEIE, TIE */
    #define RIIC_ICIER_SP_AL        ((uint8_t)(0x0A))       /* Sets ICIER.SPIE bit and clears ICIER.NAKIE bit. */
/* Enable bit  : ALIE, SPIE                 */
/* Disable bit : TMOIE, STIE, NAKIE, RIE, TEIE, TIE */
    #define RIIC_ICIER_AL           ((uint8_t)(0x02))       /* Sets ICIER.ALIE bit. */
/* Enable bit  : ALIE                       */
/* Disable bit : TMOIE, STIE, SPIE, NAKIE, RIE, TEIE, TIE */
    #define RIIC_ICIER_SP           ((uint8_t)(0x08))       /* Sets ICIER.SPIE bit. */
/* Enable bit  : SPIE                       */
/* Disable bit : TMOIE, ALIE, STIE, NAKIE, RIE, TEIE, TIE */
    #define RIIC_ICIER_TX_RX_SP_NAK_AL ((uint8_t)(0xBA))    /* Sets ICIER register. */
/* Enable bit  : ALIE, SPIE, NAKIE, RIE, TIE */
/* Disable bit : TMOIE, STIE, TEIE          */
    #define RIIC_ICIER_TX_SP_NAK_AL ((uint8_t)(0x9A))       /* Sets ICIER register. */
/* Enable bit  : ALIE, SPIE, NAKIE, TIE     */
/* Disable bit : TMOIE, STIE, TEIE, RIE     */
    #define RIIC_ICIER_RX_SP_NAK_AL ((uint8_t)(0x3A))       /* Sets ICIER register. */
/* Enable bit  : ALIE, SPIE, NAKIE, RIE     */
/* Disable bit : TMOIE, STIE, TEIE, TIE     */
    #define RIIC_ICIER_TX_RX_SP_NAK ((uint8_t)(0xB8))       /* Sets ICIER register. */
/* Enable bit  : SPIE, NAKIE, RIE, TIE      */
/* Disable bit : ALIE, TMOIE, STIE, TEIE    */
    #define RIIC_ICIER_TX_SP_NAK    ((uint8_t)(0x98))       /* Sets ICIER register. */
/* Enable bit  : SPIE, NAKIE, TIE           */
/* Disable bit : ALIE, TMOIE, STIE, TEIE, RIE */
    #define RIIC_ICIER_RX_SP        ((uint8_t)(0x28))       /* Sets ICIER register. */
/* Enable bit  : SPIE, RIE           */
/* Disable bit : ALIE, TMOIE, NAKIE, STIE, TEIE, TIE */
    #define RIIC_ICIER_TX_RX        ((uint8_t)(0xA0))       /* Sets ICIER register. */
/* Enable bit  : RIE, TIE                   */
/* Disable bit : SPIE, NAKIE, ALIE, TMOIE, STIE, TEIE */
    #define RIIC_ICIER_TX           ((uint8_t)(0x80))       /* Sets ICIER register. */
/* Enable bit  : TIE                        */
/* Disable bit : SPIE, NAKIE, ALIE, TMOIE, STIE, RIE, TEIE */
    #define RIIC_ICIER_RX           ((uint8_t)(0x20))       /* Sets ICIER register. */
/* Enable bit  : RIE                        */
/* Disable bit : SPIE, NAKIE, ALIE, TMOIE, STIE, TEIE, TIE */
    #define RIIC_ICIER_TMO          ((uint8_t)(0x01))       /* Sets ICIER register. */
/* Enable bit  : TMOIE                        */
    #define RIIC_MSK_BBSY           ((uint8_t)(0x80))       /* Mask ICCR2.BBSY bit  */
    #define RIIC_MSK_SCLSDA         ((uint8_t)(0x03))       /* Mask ICCR1.SDAI bit and SCLI bit */
    #define RIIC_SCLI_LOW           ((uint8_t)(0x00))       /* input SCL Low */

/* Common registers setting */
    #define RIIC_PWPR_BOWI          (MPC.PWPR.BIT.B0WI)     /* PWPR PFSWE Bit Write Disable */

