cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx_private.h
/* Control registers address defines */
    #define RIIC_ICCR1_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x00 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICCR2_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x01 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICMR1_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x02 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICMR2_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x03 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICMR3_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x04 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICFER_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x05 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICSER_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x06 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICIER_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x07 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICSR1_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x08 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICSR2_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x09 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_SARL0_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x0A + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_SARU0_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x0B + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_SARL1_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x0C + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_SARU1_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x0D + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_SARL2_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x0E + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_SARU2_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x0F + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICBRL_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x10 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICBRH_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x11 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICDRT_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x12 + ((32 * (n)) / sizeof(uint8_t)) )
    #define RIIC_ICDRR_ADR(n)    ( (volatile uint8_t *)&RIIC0 + 0x13 + ((32 * (n)) / sizeof(uint8_t)) )

    #ifdef TN_RXA012A
        #define RIIC_TMOCNTL_ADR(n)  ( (volatile uint8_t *)&RIIC0 + 0x0A + ((32 * (n)) / sizeof(uint8_t)) )
        #define RIIC_TMOCNTH_ADR(n)  ( (volatile uint8_t *)&RIIC0 + 0x0B + ((32 * (n)) / sizeof(uint8_t)) )
    #endif

/* Base register of PCR used to calculate all PCR register addresses. This is constant for all supported MCUs. */
    #define RIIC_PRV_PCR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-95))
/* Base register of PDR used to calculate all PDR register addresses. This is constant for all supported MCUs. */
    #define RIIC_PRV_PDR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-287))
/* Base register of PMR used to calculate all PMR register addresses. This is constant for all supported MCUs. */
    #define RIIC_PRV_PMR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-191))
/* Base register of PFS used to calculate all PFS register addresses. This is constant for all supported MCUs. */
    #define RIIC_PRV_PFS_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE+33))

/***********************************************************************************************************************
 Typedef definitions
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   Define internal iic information structure type.                          */
/*----------------------------------------------------------------------------*/
/* ---- Internal Mode. ---- */
typedef enum
{
    RIIC_MODE_NONE = 0U, /* Non-communication mode */
    RIIC_MODE_M_SEND, /* Master transmission mode */
    RIIC_MODE_M_RECEIVE, /* Master reception mode */
    RIIC_MODE_M_SEND_RECEIVE, /* Master transmission reception mode */
    RIIC_MODE_S_READY, /* Multi master transfer mode */
    RIIC_MODE_S_SEND, /* Slave transmission mode */
    RIIC_MODE_S_RECEIVE /* Slave reception mode */
} riic_api_mode_t;

/* ---- Internal Status. ---- */
typedef enum
{
    RIIC_STS_NO_INIT = 0U, /* None initialization state */
    RIIC_STS_IDLE, /* Idle state */
    RIIC_STS_IDLE_EN_SLV, /* Idle state on enable slave transfer */
    RIIC_STS_ST_COND_WAIT, /* Start condition generation completion wait state */
    RIIC_STS_SEND_SLVADR_W_WAIT, /* Slave address [Write] transmission completion wait state */
    RIIC_STS_SEND_SLVADR_R_WAIT, /* Slave address [Read] transmission completion wait state */
    RIIC_STS_SEND_DATA_WAIT, /* Data transmission completion wait state */
    RIIC_STS_RECEIVE_DATA_WAIT, /* Data reception completion wait state */
    RIIC_STS_SP_COND_WAIT, /* Stop condition generation completion wait state */
    RIIC_STS_AL, /* Detect Arbitration Lost */
    RIIC_STS_TMO, /* Detect Time out */
    RIIC_STS_MAX /* Prohibition of setup above here */

} riic_api_status_t;

/* ---- Internal Event. ---- */
typedef enum
{
    RIIC_EV_INIT = 0U, /* Called function of Initializes IIC driver */
    RIIC_EV_EN_SLV_TRANSFER, /* Enable Slave Transfer */
    RIIC_EV_GEN_START_COND, /* Called function of Start condition generation */
    RIIC_EV_INT_START, /* Interrupted start codition generation */
    RIIC_EV_INT_ADD, /* Interrupted address sending */
    RIIC_EV_INT_SEND, /* Interrupted data sending */
    RIIC_EV_INT_RECEIVE, /* Interrupted data receiving */
    RIIC_EV_INT_STOP, /* Interrupted Stop condition generation */
    RIIC_EV_INT_AL, /* Interrupted Arbitration-Lost */
    RIIC_EV_INT_NACK, /* Interrupted No Acknowledge */
    RIIC_EV_INT_TMO, /* Interrupted Time out */
    RIIC_EV_MAX /* Prohibition of setup above here */
} riic_api_event_t;

/* ---- Internal Infomation structure. ---- */
typedef struct
{
    riic_api_mode_t   N_Mode; /* Internal mode of control protocol */
    riic_api_mode_t   B_Mode; /* Internal mode of control protocol */
    riic_api_status_t N_status; /* Internal Status of Now */
    riic_api_status_t B_status; /* Internal Status of Before */
} riic_api_info_t;

/* ---- Internal state transition structure ---- */
typedef struct
{
    riic_api_event_t event_type; /* Event */
    riic_return_t    (*proc) (riic_info_t *); /* handler */
} riic_mtx_t;

