cl234583745/Renesas/RX23E-A/6_rx i2c slave fit311/rx23e_fit_i2c/src/smc_gen/r_riic_rx/src/r_riic_rx_private.h
/***********************************************************************************************************************
 Exported global functions (to be accessed by other files)
 **********************************************************************************************************************/
/******************************************************************************
 * Function Name: riic_mcu_check_channel
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
bool riic_mcu_check_channel (uint8_t channe);

/******************************************************************************
 * Function Name: riic_mcu_int_init
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
void riic_mcu_int_init (uint8_t channe);

/******************************************************************************
 * Function Name: riic_mcu_check_ir_txi
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
uint8_t riic_mcu_check_ir_txi (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_check_ir_rxi
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
uint8_t riic_mcu_check_ir_rxi (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_clear_ir_txi
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
void riic_mcu_clear_ir_txi (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_clear_ir_rxi
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
void riic_mcu_clear_ir_rxi (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_int_enable
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
void riic_mcu_int_enable (uint8_t channe);

/******************************************************************************
 * Function Name: riic_mcu_int_disable
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
void riic_mcu_int_disable (uint8_t channe);

/******************************************************************************
 * Function Name: riic_mcu_power_on
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
void riic_mcu_power_on (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_power_off
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
void riic_mcu_power_off (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_hardware_lock
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
bool riic_mcu_hardware_lock (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_hardware_unlock
 * Description  : .
 * Argument     : channel
 * Return Value : .
 *****************************************************************************/
void riic_mcu_hardware_unlock (uint8_t channel);

/******************************************************************************
 * Function Name: riic_mcu_check_freq
 * Description  : .
 * Return Value : .
 *****************************************************************************/
double riic_mcu_check_freq (void);

/******************************************************************************
 * Function Name: riic_mcu_int_icier_setting
 * Description  : .
 * Arguments    : channel
 *              : New_icier
 * Return Value : .
 *****************************************************************************/
void riic_mcu_int_icier_setting (uint8_t channel, uint8_t New_icier);

    #if (1U == RIIC_CFG_PORT_SET_PROCESSING)
/******************************************************************************
 * Function Name: riic_mcu_io_open
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
void riic_mcu_io_open (uint8_t channe);

/******************************************************************************
 * Function Name: riic_mcu_mpc_enable
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
void riic_mcu_mpc_enable (uint8_t channe);

/******************************************************************************
 * Function Name: riic_mcu_mpc_disable
 * Description  : .
 * Argument     : channe
 * Return Value : .
 *****************************************************************************/
void riic_mcu_mpc_disable (uint8_t channe);
    #endif

    #if (1U == RIIC_CFG_CH0_INCLUDED)
/******************************************************************************
 * Function Name: riic0_eei_sub
 * Description  : .
 * Return Value : .
 *****************************************************************************/
void riic0_eei_sub (void);

/******************************************************************************
 * Function Name: riic0_txi_sub
 * Description  : .
 * Return Value : .
 *****************************************************************************/
void riic0_txi_sub (void);

/******************************************************************************
 * Function Name: riic0_rxi_sub
 * Description  : .
 * Return Value : .
 *****************************************************************************/
void riic0_rxi_sub (void);

/******************************************************************************
 * Function Name: riic0_tei_sub
 * Description  : .
 * Return Value : .
 *****************************************************************************/
void riic0_tei_sub (void);
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
void riic1_eei_sub (void);
void riic1_txi_sub (void);
void riic1_rxi_sub (void);
void riic1_tei_sub (void);
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
void riic2_eei_sub (void);
void riic2_txi_sub (void);
void riic2_rxi_sub (void);
void riic2_tei_sub (void);
    #endif

#endif /* RIIC_PRIVATE_H */

